In [2]:
import pandas as pd
import numpy as np

In [8]:
s1 = pd.Series(np.arange(4), index = ["a","c","d","e"])
s2 = pd.Series(np.arange(4), index = ["0","1","2","3"])
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
0    0
1    1
2    2
3    3
dtype: int32

In [11]:
df1 = pd.DataFrame(
np.arange(6).reshape(2,3),
    index = ["Tim","Tom"],
    columns = list("ABC")
)
df2 = pd.DataFrame(
np.arange(9).reshape(3,3),
    index = ["Tim","Kate","Tom"],
    columns = list("ACD")
)
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [22]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [23]:
df1.add(df2, fill_value = 0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [24]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [25]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [30]:
df1.mul(df2)

         A   B     C   D
Kate   NaN NaN   NaN NaN
Tim    0.0 NaN   2.0 NaN
Tom   18.0 NaN  35.0 NaN

In [41]:
s = df2.iloc[1]
print(s)
df2-s

A    3
C    4
D    5
Name: Kate, dtype: int32

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [40]:
s2 = df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [43]:
df2.sub(s2, axis = 0)

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

APPLYING A FUNCTION

In [57]:
df = pd.DataFrame(np.random.randn(4,3),
                 index = ["Kim","Susan","Tim", "Tom",],
                 columns = list("ABC"))
df

              A         B         C
Kim    0.704459  0.769630  0.400899
Susan -0.302268  1.507208 -1.166725
Tim   -0.094054  0.260833  1.752687
Tom   -1.203496  0.362038 -0.365822

In [58]:
abs(df)

              A         B         C
Kim    0.704459  0.769630  0.400899
Susan  0.302268  1.507208  1.166725
Tim    0.094054  0.260833  1.752687
Tom    1.203496  0.362038  0.365822

In [59]:
df

              A         B         C
Kim    0.704459  0.769630  0.400899
Susan -0.302268  1.507208 -1.166725
Tim   -0.094054  0.260833  1.752687
Tom   -1.203496  0.362038 -0.365822

In [60]:
def calculate_range(x):
    return x.max()- x.min()
df.apply(calculate_range)

A    1.907956
B    1.246375
C    2.919412
dtype: float64

In [62]:
#Applying lambda function
f_Lambda = lambda x: x.max() - x.min()
df.apply(f_Lambda)

A    1.907956
B    1.246375
C    2.919412
dtype: float64

In [64]:
df.apply(f_Lambda,axis=1)

Kim      0.368730
Susan    2.673933
Tim      1.846741
Tom      1.565534
dtype: float64

In [68]:
def f (x):
   return x**2
df.apply(f)

              A         B         C
Kim    0.496263  0.592330  0.160720
Susan  0.091366  2.271676  1.361247
Tim    0.008846  0.068034  3.071911
Tom    1.448403  0.131071  0.133826

In [71]:
f = lambda x: x**2
df.apply(f)

              A         B         C
Kim    0.496263  0.592330  0.160720
Susan  0.091366  2.271676  1.361247
Tim    0.008846  0.068034  3.071911
Tom    1.448403  0.131071  0.133826

In [73]:
s = pd.Series(np.arange(5), index = ["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int32

In [74]:
s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int32

In [76]:
df = pd.DataFrame(
np.arange(12).reshape(3,4),
    index = ["two","one","three"],
    columns = list("dabc")
)
df

       d  a   b   c
two    0  1   2   3
one    4  5   6   7
three  8  9  10  11

In [79]:
df.sort_index()

       d  a   b   c
one    4  5   6   7
three  8  9  10  11
two    0  1   2   3

In [81]:
df.sort_index(axis = 1)

       a   b   c  d
two    1   2   3  0
one    5   6   7  4
three  9  10  11  8

In [85]:
df.sort_index(axis = 1,ascending = False)

       d   c   b  a
two    0   3   2  1
one    4   7   6  5
three  8  11  10  9

In [91]:
s2 = pd.Series([5,np.nan,3,-1,9])
s2

0    5.0
1    NaN
2    3.0
3   -1.0
4    9.0
dtype: float64

In [92]:
s2.sort_values()

3   -1.0
2    3.0
0    5.0
4    9.0
1    NaN
dtype: float64

In [93]:
s2.sort_values(ascending=False)

4    9.0
0    5.0
2    3.0
3   -1.0
1    NaN
dtype: float64

In [99]:
df2 = pd.DataFrame({"a" : [5,3,-1,9], "b": [1,-2,0,-5]})
df2

   a  b
0  5  1
1  3 -2
2 -1  0
3  9 -5

In [100]:
df2.sort_values(by="b")

   a  b
3  9 -5
1  3 -2
2 -1  0
0  5  1

In [105]:
df2.sort_values(by=["b","a"])

   a  b
3  9 -5
1  3 -2
2 -1  0
0  5  1